new Vue({
  el: "#app", // Привязываем Vue к элементу с id "app"
  data: {
    // Массив объектов, представляющих новости
    newsList: [
      {
        id: 1,
        title: "Создадим лучший макет перепланировки",
        image: "img/news_1.png",
        date: "2024-07-01",
        category: "Дизайн кухни",
      },
      {
        id: 2,
        title: "Лучшие интерьерные идеи по низкой цене",
        image: "img/news_2.png",
        date: "2024-07-02",
        category: "Дизайн для жизни",
      },
      {
        id: 3,
        title: "Лучшие интерьерные решения для офисов",
        image: "img/news_3.png",
        date: "2024-07-03",
        category: "Дизайн Интерьера",
      },
      {
        id: 4,
        title: "Создадим лучший макет перепланировки",
        image: "img/news_4.png",
        date: "2024-07-04",
        category: "Дизайн кухни",
      },
      {
        id: 5,
        title: "Лучшие интерьерные идеи по низкой цене",
        image: "img/news_5.png",
        date: "2024-07-05",
        category: "Дизайн для жизни",
      },
      {
        id: 6,
        title: "Лучшие интерьерные решения для офисов",
        image: "img/news_6.png",
        date: "2024-07-06",
        category: "Дизайн интерьера",
      },
    ],
  },
});
